# -*- org-confirm-babel-evaluate: nil -*-
#+OPTIONS: ^:nil
#+OPTIONS: html-postamble:nil
#+OPTIONS: num:3
#+LANGUAGE: en-us
#+HTML_DOCTYPE: html5
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="http://www.pirilampo.org/styles/readtheorg/css/htmlize.css"/>
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="http://www.pirilampo.org/styles/readtheorg/css/readtheorg.css"/>
#+HTML_HEAD: <style>blockquote p:last-child, div.figure p {margin: 0;}</style>
#+LATEX_CLASS: article
#+LATEX_CLASS_OPTIONS: [a4paper,12pt]
#+LATEX_HEADER: \usepackage[english]{babel}
#+LATEX_HEADER: \renewcommand{\familydefault}{\sfdefault}
#+LATEX_HEADER: \usepackage{helvet}
#+LATEX_HEADER: \usepackage[margin=1in]{geometry}
#+LATEX_HEADER: \usepackage{parskip}
#+LATEX_HEADER: \usepackage{tabularx}
#+LATEX_HEADER: \usepackage{float}
#+LATEX_HEADER: \usepackage{color}
#+LATEX_HEADER: \usepackage{titlesec}
#+LATEX_HEADER: \usepackage{listings}
#+LATEX_HEADER: \usepackage[utf8]{inputenc}
#+LATEX_HEADER: \usepackage[document]{ragged2e}
#+LATEX_HEADER: \usepackage[T1]{fontenc}
#+LATEX_HEADER: \usepackage{sectsty}
#+LATEX_HEADER: \titleformat*{\section}{\LARGE\bfseries}
#+LATEX_HEADER: \titleformat*{\subsection}{\Large\bfseries}
#+LATEX_HEADER: \titleformat*{\subsubsection}{\large\bfseries}
#+LATEX_HEADER: \titleformat*{\paragraph}{\large\bfseries}
#+LATEX_HEADER: \titleformat*{\subparagraph}{\large\bfseries}
#+LATEX_HEADER: \renewcommand{\baselinestretch}{1.2}
#+LATEX_HEADER: \definecolor{light_grey}{RGB}{51,51,51}
#+LATEX_HEADER: \definecolor{bright_grey}{RGB}{249,249,249}
#+LATEX_HEADER: \definecolor{python_blue}{RGB}{41,128,185}
#+LATEX_HEADER: \hypersetup{colorlinks=true, urlcolor=python_blue, linkcolor=python_blue, citecolor=red}
#+LATEX_HEADER: \tolerance=1
#+LATEX_HEADER: \emergencystretch=\maxdimen
#+LATEX_HEADER: \hyphenpenalty=10000
#+LATEX_HEADER: \hbadness=10000
#+LATEX_HEADER: \makeatletter
#+LATEX_HEADER: \makeatother
#+LATEX_HEADER: \lstset{
#+LATEX_HEADER:   xleftmargin=0.5cm,frame=tlbr,framesep=4pt,framerule=0pt,
#+LATEX_HEADER:   columns=fullflexible,
#+LATEX_HEADER:   backgroundcolor=\color{white},
#+LATEX_HEADER:   basicstyle=\footnotesize\ttfamily,
#+LATEX_HEADER:   breakatwhitespace=false,
#+LATEX_HEADER:   breaklines=true,
#+LATEX_HEADER:   frame=single,
#+LATEX_HEADER:   keepspaces=true,
#+LATEX_HEADER:   rulecolor=\color{black},
#+LATEX_HEADER:   showspaces=false,
#+LATEX_HEADER:   showstringspaces=false,
#+LATEX_HEADER:   showtabs=false,
#+LATEX_HEADER:   stepnumber=2,
#+LATEX_HEADER:   tabsize=2,
#+LATEX_HEADER: }
#+LATEX_HEADER: \DeclareUnicodeCharacter{202F}{ }
#+LATEX: \frenchspacing
#+LATEX: \raggedright
#+TITLE: Guide: running the pipeline
#+AUTHOR: Richard Zetterberg <richard.zetterberg@regionh.dk>
#+PROPERTY: header-args:R :session *R* :tangle yes :shebang "#!/usr/bin/env Rscript"

#+LATEX: \clearpage

#+BEGIN_SRC R :exports none :tangle no
devtools::load_all(".")
source("./tests/utils.R")
#+END_SRC

#+RESULTS:

#+BEGIN_SRC R :exports results :results output :tangle no
#set.seed(6)
#n_count <- 10000
#
#d1_tte <- generate_random_tte(n_count)
#d1_tte <- generate_failure(d1_tte, 20, 10)
#d1_tte <- generate_diagnosed_relatives(d1_tte, "relatives_diagnosed") |>
#  relocate(failure_time, .after = person_id) |>
#  relocate(failure_status, .after = failure_time) |>
#  relocate(relatives, .after = failure_status) |>
#  relocate(relatives_diagnosed, .after = relatives) |>
#  mutate(person_id = as.character(person_id), disorder = "SCZ", relationship_kind = "FS") |>
#  as.data.table()
#
#d2_tte <- copy(d1_tte |> select(-failure_time, -failure_status, -relatives_diagnosed, -disorder, -relationship_kind))
#d2_tte <- generate_failure(d2_tte, 19, 11)
#d2_tte <- generate_diagnosed_relatives(d2_tte, "relatives_diagnosed") |>
#  relocate(failure_time, .after = person_id) |>
#  relocate(failure_status, .after = failure_time) |>
#  relocate(relatives, .after = failure_status) |>
#  relocate(relatives_diagnosed, .after = relatives) |>
#  mutate(person_id = as.character(person_id), disorder = "CAD", relationship_kind = "FS") |>
#  as.data.table()
#
#d3_tte <- copy(d1_tte |> select(-failure_time, -failure_status, -relatives_diagnosed, -disorder, -relationship_kind))
#d3_tte <- generate_failure(d2_tte, 20, 10)
#d3_tte <- generate_diagnosed_relatives(d2_tte, "relatives_diagnosed") |>
#  relocate(failure_time, .after = person_id) |>
#  relocate(failure_status, .after = failure_time) |>
#  relocate(relatives, .after = failure_status) |>
#  relocate(relatives_diagnosed, .after = relatives) |>
#  mutate(person_id = as.character(person_id), disorder = "SCZ", relationship_kind = "PO") |>
#  as.data.table()
#
#d4_tte <- copy(d1_tte |> select(-failure_time, -failure_status, -relatives_diagnosed, -disorder, -relationship_kind))
#d4_tte <- generate_failure(d2_tte, 19, 11)
#d4_tte <- generate_diagnosed_relatives(d2_tte, "relatives_diagnosed") |>
#  relocate(failure_time, .after = person_id) |>
#  relocate(failure_status, .after = failure_time) |>
#  relocate(relatives, .after = failure_status) |>
#  relocate(relatives_diagnosed, .after = relatives) |>
#  mutate(person_id = as.character(person_id), disorder = "CAD", relationship_kind = "PO") |>
#  as.data.table()
#
#tte <- rbindlist(list(d1_tte, d2_tte, d3_tte, d4_tte)) |> select(-born_at, -dead_at_year) |>
#  arrange(person_id, disorder, relationship_kind) |>
#  select(person_id, born_at_year, gender, disorder, failure_status, failure_time, relationship_kind, relatives, relatives_diagnosed)
#
#write_csv(tte, "./guides/data/tte-pool.csv")

tte <- read_csv(
  "./guides/data/tte-pool.csv",
  show_col_type = FALSE,
  col_types=cols(person_id = col_character()),
) |> as.data.table()
#+END_SRC

#+RESULTS:

This is a guide that explains how you run the epimight pipeline to estimates genetic
correlation between 2 disorders stratified by birth year and gender using TTE (time-to-event) data.

All code shown in this guide have been written to [[./guide.R][this R file]], so that you don't have
to copy all code snippets manually.

* How it works

The concept is pretty simple:

1. Create a pool of time-to-event data
2. Create a new pipeline instance from said pool
3. Run trails by supplying the disorders and relationship kind to test

The idea here is that your "pool" contains time-to-event data for multiple disorders and relationship kinds.
Then when you run a trail, you specify exactly which disorders and relationship kind to use.
By having all the time-to-event data in a big pool and letting the trails pull from this pool minimizes
data handling between trails.

Besides controlling what disorder and relationship kind to use for each trail, you can specify which columns
to stratify the results on and how many independent draws to perform. We'll get into the details of how trails
are carried out later. First we need to understand to just get the pipeline running.

* Setting up the pool

First we need to be able to uniquely identify every individual in your sample population.
In the test data of this guide we use a unique number for each individual:

#+BEGIN_SRC R :exports results :results value :colnames yes :tangle no
tte |> distinct(person_id) |> tail(4)
#+END_SRC

#+RESULTS:
| person_id |
|-----------|
|      9996 |
|      9997 |
|      9998 |
|      9999 |

Then we need to have the stratification data of each individual (in our case, birth year and gender):

#+BEGIN_SRC R :exports results :results value :colnames yes :tangle no
tte |>
  distinct(person_id, born_at_year, gender) |>
  tail(4)
#+END_SRC

#+RESULTS:
| person_id | born_at_year | gender |
|-----------+--------------+--------|
|      9996 |         2001 | m      |
|      9997 |         1999 | m      |
|      9998 |         2010 | m      |
|      9999 |         1991 | f      |

Then for each relationship kind, we need to know how many relatives each individual has. In the test data
of this guide, we have 2 relationship kinds (~PO~ = "parent offspring", ~FS~ = "full siblings"):

#+BEGIN_SRC R :exports results :results value :colnames yes :tangle no
tte |>
  distinct(person_id, born_at_year, gender, relationship_kind, relatives) |>
  tail(4 * 2)
#+END_SRC

#+RESULTS:
| person_id | born_at_year | gender | relationship_kind | relatives |
|-----------+--------------+--------+-------------------+-----------|
|      9996 |         2001 | m      | FS                |         3 |
|      9996 |         2001 | m      | PO                |         3 |
|      9997 |         1999 | m      | FS                |         5 |
|      9997 |         1999 | m      | PO                |         5 |
|      9998 |         2010 | m      | FS                |         0 |
|      9998 |         2010 | m      | PO                |         0 |
|      9999 |         1991 | f      | FS                |         1 |
|      9999 |         1991 | f      | PO                |         1 |

Then for each disorder, we to know:

- The individuals failure status/time
- The relatives diagnosis status

Since the guide test data has:

- 2 disorders (~SCZ~ = "schizophrenia", ~CAD~ = "coronary artery disease")
- 2 relationship kinds (~PO~, ~FS~)

Each individual gets 4 rows to cover all combinations of ~disorders x relationship_kinds~:

#+BEGIN_SRC R :exports results :results value :colnames yes :tangle no
tte |> tail(4 * 4)
#+END_SRC

#+RESULTS:
| person_id | born_at_year | gender | disorder | failure_status | failure_time | relationship_kind | relatives | relatives_diagnosed |
|-----------+--------------+--------+----------+----------------+--------------+-------------------+-----------+---------------------|
|      9996 |         2001 | m      | CAD      |              0 |           25 | FS                |         3 |                   0 |
|      9996 |         2001 | m      | CAD      |              0 |           25 | PO                |         3 |                   0 |
|      9996 |         2001 | m      | SCZ      |              0 |           25 | FS                |         3 |                   0 |
|      9996 |         2001 | m      | SCZ      |              0 |           25 | PO                |         3 |                   0 |
|      9997 |         1999 | m      | CAD      |              0 |           27 | FS                |         5 |                   0 |
|      9997 |         1999 | m      | CAD      |              0 |           27 | PO                |         5 |                   0 |
|      9997 |         1999 | m      | SCZ      |              0 |           27 | FS                |         5 |                   0 |
|      9997 |         1999 | m      | SCZ      |              0 |           27 | PO                |         5 |                   0 |
|      9998 |         2010 | m      | CAD      |              0 |           16 | FS                |         0 |                   0 |
|      9998 |         2010 | m      | CAD      |              0 |           16 | PO                |         0 |                   0 |
|      9998 |         2010 | m      | SCZ      |              0 |           16 | FS                |         0 |                   0 |
|      9998 |         2010 | m      | SCZ      |              0 |           16 | PO                |         0 |                   0 |
|      9999 |         1991 | f      | CAD      |              0 |           35 | FS                |         1 |                   0 |
|      9999 |         1991 | f      | CAD      |              0 |           35 | PO                |         1 |                   0 |
|      9999 |         1991 | f      | SCZ      |              0 |           35 | FS                |         1 |                   0 |
|      9999 |         1991 | f      | SCZ      |              0 |           35 | PO                |         1 |                   0 |

For our example, that is a complete TTE data pool that can be passed to the pipeline.

* Setting up the pipeline

To setup the pipeline, we just need to import it:

#+BEGIN_SRC R :exports code :eval no
library(epimight)
#+END_SRC

And then create a new instance with our TTE pool (the variable ~tte~ is the data table shown in the previous chapter):

#+BEGIN_SRC R :exports code :results output
pipeline <- Pipeline$new(pool = tte)
#+END_SRC

#+RESULTS:

The supplied pool must be a ~data.table~ with the following required columns:

- ~person_id~
- ~disorder~
- ~failure_status~
- ~failure_time~
- ~relationship_kind~
- ~relatives~
- ~relatives_diagnosed~

It accepts any additional columns.

* Running trails

After creating the pipeline instance, you run trails by supplying the ~run_trail~ function with:

- Disorder 1
  - Identifier
  - Earliest onset
  - Latest onset
- Disorder 2
  - Identifier
  - Earliest onset
  - Latest onset
- Relationship kind
- How many draws to perform

For example, if you want to run a trail between schizophrenia and coronary artery disease of full siblings, you would run:

#+BEGIN_SRC R :exports code :results output
trail1 <- pipeline$run_trail(
  disorder1 = list(
    id             = "SCZ",
    earliest_onset = 1,
    latest_onset   = 100
  ),
  disorder2 = list(
    id             = "CAD",
    earliest_onset = 1,
    latest_onset   = 100
  ),
  relationship_kind = "FS",
  draws = 2
)
#+END_SRC

#+RESULTS:

Each trail contains:

- The arguments passed to it
- Any errors encountered
- The draws results
- The meta analyzed draw results
- The rubin combined draw results
- The meta analyzed rubin combined draw results

#+BEGIN_SRC R :exports both :results output
print(trail1)
#+END_SRC

#+RESULTS:
#+begin_example
$args
$args$disorder1
$args$disorder1$id
[1] "SCZ"

$args$disorder1$earliest_onset
[1] 1

$args$disorder1$latest_onset
[1] 100


$args$disorder2
$args$disorder2$id
[1] "CAD"

$args$disorder2$earliest_onset
[1] 1

$args$disorder2$latest_onset
[1] 100


$args$relationship_kind
[1] "FS"

$args$draws
[1] 2


$draw_errors
list()

$draw_results
    draw time re_d1_c1_estimate re_d1_c1_variance re_d1_c1_l95 re_d1_c1_u95 re_d1_c1_cases
 1:    1   76       0.135988576      1.581728e-05  0.128193614  0.143783537           1011
 2:    1   40       0.134108667      1.549140e-05  0.126394423  0.141822912           1006
 3:    1   39       0.132557586      1.524561e-05  0.124904784  0.140210388           1002
 4:    1   38       0.130856348      1.498319e-05  0.123269695  0.138443000            994
 5:    1   36       0.128831780      1.467947e-05  0.121322415  0.136341146            977
 6:    1   35       0.127596832      1.450289e-05  0.120132767  0.135060896            974
 7:    1   34       0.125529117      1.421452e-05  0.118139633  0.132918602            967
 8:    1   33       0.124011817      1.400759e-05  0.116676314  0.131347319            955
 9:    1   31       0.119943157      1.347255e-05  0.112749115  0.127137198            933
10:    1   30       0.117107821      1.311136e-05  0.110010867  0.124204774            921
11:    1   29       0.113859619      1.270366e-05  0.106873878  0.120845359            903
12:    1   28       0.110973663      1.234668e-05  0.104086772  0.117860553            882
13:    1   27       0.106936712      1.185263e-05  0.100189017  0.113684407            863
14:    1   26       0.102239469      1.128440e-05  0.095655508  0.108823430            836
15:    1   25       0.097060081      1.066539e-05  0.090659249  0.103460914            804
16:    1   24       0.092811619      1.016142e-05  0.086563846  0.099059392            768
17:    1   23       0.088355743      9.637877e-06  0.082271049  0.094440438            738
18:    1   22       0.082048684      8.900821e-06  0.076201280  0.087896088            706
19:    1   21       0.076936997      8.308683e-06  0.071287443  0.082586552            660
20:    1   20       0.072183705      7.763547e-06  0.066722629  0.077644781            622
21:    1   19       0.067633674      7.245387e-06  0.062357988  0.072909360            586
22:    1   18       0.062774269      6.696369e-06  0.057702403  0.067846135            551
23:    1   17       0.057730676      6.129181e-06  0.052878357  0.062582994            513
24:    1   16       0.052654728      5.563505e-06  0.048031744  0.057277711            473
25:    1   15       0.047661649      5.010953e-06  0.043274239  0.052049060            432
26:    1   14       0.043699576      4.574998e-06  0.039507361  0.047891791            391
27:    1   13       0.038262021      3.980678e-06  0.034351572  0.042172470            358
28:    1   12       0.034894835      3.616221e-06  0.031167696  0.038621974            312
29:    1   11       0.030315994      3.123923e-06  0.026851832  0.033780157            283
30:    1   10       0.027041179      2.773959e-06  0.023776819  0.030305540            243
31:    1    9       0.024260026      2.479528e-06  0.021173765  0.027346286            214
32:    1    8       0.020526607      2.086971e-06  0.017695174  0.023358040            189
33:    1    7       0.017389349      1.759844e-06  0.014789279  0.019989420            155
34:    1    6       0.014077659      1.416712e-06  0.011744798  0.016410520            126
35:    1    5       0.012284497      1.232363e-06  0.010108705  0.014460290             95
36:    1    4       0.010827076      1.084043e-06  0.008786413  0.012867739             78
37:    1    3       0.008150296      8.135606e-07  0.006382456  0.009918137             64
38:    1    2       0.005607353      5.583855e-07  0.004142766  0.007071940             38
39:    1    1       0.004300000      4.281938e-07  0.003017468  0.005582532             13
40:    2   76       0.135988576      1.581728e-05  0.128193614  0.143783537           1011
41:    2   40       0.134108667      1.549140e-05  0.126394423  0.141822912           1006
42:    2   39       0.132557586      1.524561e-05  0.124904784  0.140210388           1002
43:    2   38       0.130856348      1.498319e-05  0.123269695  0.138443000            994
44:    2   36       0.128831780      1.467947e-05  0.121322415  0.136341146            977
45:    2   35       0.127596832      1.450289e-05  0.120132767  0.135060896            974
46:    2   34       0.125529117      1.421452e-05  0.118139633  0.132918602            967
47:    2   33       0.124011817      1.400759e-05  0.116676314  0.131347319            955
48:    2   31       0.119943157      1.347255e-05  0.112749115  0.127137198            933
49:    2   30       0.117107821      1.311136e-05  0.110010867  0.124204774            921
50:    2   29       0.113859619      1.270366e-05  0.106873878  0.120845359            903
51:    2   28       0.110973663      1.234668e-05  0.104086772  0.117860553            882
52:    2   27       0.106936712      1.185263e-05  0.100189017  0.113684407            863
53:    2   26       0.102239469      1.128440e-05  0.095655508  0.108823430            836
54:    2   25       0.097060081      1.066539e-05  0.090659249  0.103460914            804
55:    2   24       0.092811619      1.016142e-05  0.086563846  0.099059392            768
56:    2   23       0.088355743      9.637877e-06  0.082271049  0.094440438            738
57:    2   22       0.082048684      8.900821e-06  0.076201280  0.087896088            706
58:    2   21       0.076936997      8.308683e-06  0.071287443  0.082586552            660
59:    2   20       0.072183705      7.763547e-06  0.066722629  0.077644781            622
60:    2   19       0.067633674      7.245387e-06  0.062357988  0.072909360            586
61:    2   18       0.062774269      6.696369e-06  0.057702403  0.067846135            551
62:    2   17       0.057730676      6.129181e-06  0.052878357  0.062582994            513
63:    2   16       0.052654728      5.563505e-06  0.048031744  0.057277711            473
64:    2   15       0.047661649      5.010953e-06  0.043274239  0.052049060            432
65:    2   14       0.043699576      4.574998e-06  0.039507361  0.047891791            391
66:    2   13       0.038262021      3.980678e-06  0.034351572  0.042172470            358
67:    2   12       0.034894835      3.616221e-06  0.031167696  0.038621974            312
68:    2   11       0.030315994      3.123923e-06  0.026851832  0.033780157            283
69:    2   10       0.027041179      2.773959e-06  0.023776819  0.030305540            243
70:    2    9       0.024260026      2.479528e-06  0.021173765  0.027346286            214
71:    2    8       0.020526607      2.086971e-06  0.017695174  0.023358040            189
72:    2    7       0.017389349      1.759844e-06  0.014789279  0.019989420            155
73:    2    6       0.014077659      1.416712e-06  0.011744798  0.016410520            126
74:    2    5       0.012284497      1.232363e-06  0.010108705  0.014460290             95
75:    2    4       0.010827076      1.084043e-06  0.008786413  0.012867739             78
76:    2    3       0.008150296      8.135606e-07  0.006382456  0.009918137             64
77:    2    2       0.005607353      5.583855e-07  0.004142766  0.007071940             38
78:    2    1       0.004300000      4.281938e-07  0.003017468  0.005582532             13
    draw time re_d1_c1_estimate re_d1_c1_variance re_d1_c1_l95 re_d1_c1_u95 re_d1_c1_cases
    re_d1_c3_estimate re_d1_c3_variance re_d1_c3_l95 re_d1_c3_u95 re_d1_c3_cases
 1:       0.127086497      6.622936e-05 0.1111360310  0.143036962            216
 2:       0.124257509      6.396961e-05 0.1085815206  0.139933498            214
 3:       0.121714211      6.217723e-05 0.1062593966  0.137169024            213
 4:       0.120071019      6.105628e-05 0.1047561516  0.135385887            210
 5:       0.116857850      5.890987e-05 0.1018145842  0.131901116            205
 6:       0.114543941      5.742801e-05 0.0996910840  0.129396797            204
 7:       0.113782586      5.694616e-05 0.0989921727  0.128572998            201
 8:       0.112294395      5.602743e-05 0.0976237765  0.126965014            200
 9:       0.110876335      5.519871e-05 0.0963146186  0.125438051            198
10:       0.106013940      5.240543e-05 0.0918254477  0.120202432            196
11:       0.103965080      5.124236e-05 0.0899349182  0.117995241            189
12:       0.101967974      5.013761e-05 0.0880898770  0.115846070            186
13:       0.099344067      4.870352e-05 0.0856658889  0.113022245            183
14:       0.096125139      4.697108e-05 0.0826924376  0.109557841            179
15:       0.091712919      4.463416e-05 0.0786186344  0.104807204            174
16:       0.085491775      4.134826e-05 0.0728886947  0.098094855            167
17:       0.082445445      3.976074e-05 0.0700866725  0.094804217            157
18:       0.075263022      3.605026e-05 0.0634950309  0.087031012            152
19:       0.071742449      3.425037e-05 0.0602719928  0.083212906            140
20:       0.065958913      3.131064e-05 0.0549917566  0.076926070            134
21:       0.063687689      3.016956e-05 0.0529222294  0.074453148            124
22:       0.060879313      2.876774e-05 0.0503669359  0.071391691            120
23:       0.055892832      2.629497e-05 0.0458424070  0.065943257            115
24:       0.049920906      2.336413e-05 0.0404471346  0.059394678            106
25:       0.046167772      2.152771e-05 0.0370739373  0.055261607             95
26:       0.042986564      1.997831e-05 0.0342260933  0.051747035             88
27:       0.036195530      1.668819e-05 0.0281888459  0.044202214             82
28:       0.032604986      1.496320e-05 0.0250233948  0.040186578             69
29:       0.027553315      1.255329e-05 0.0206090415  0.034497589             62
30:       0.024562705      1.113464e-05 0.0180225769  0.031102833             52
31:       0.021126338      9.519497e-06 0.0150791276  0.027173549             46
32:       0.018217353      8.160904e-06 0.0126182654  0.023816440             39
33:       0.016301679      7.273094e-06 0.0110159162  0.021587442             33
34:       0.012510934      5.525250e-06 0.0079038720  0.017117996             29
35:       0.012044036      5.312277e-06 0.0075266375  0.016561435             21
36:       0.010665493      4.692473e-06 0.0064197963  0.014911190             20
37:       0.007946296      3.482012e-06 0.0042889737  0.011603618             17
38:       0.004382565      1.913135e-06 0.0016716183  0.007093511             11
39:       0.003062117      1.335992e-06 0.0007966909  0.005327544              3
40:       0.127086497      6.622936e-05 0.1111360310  0.143036962            216
41:       0.124257509      6.396961e-05 0.1085815206  0.139933498            214
42:       0.121714211      6.217723e-05 0.1062593966  0.137169024            213
43:       0.120071019      6.105628e-05 0.1047561516  0.135385887            210
44:       0.116857850      5.890987e-05 0.1018145842  0.131901116            205
45:       0.114543941      5.742801e-05 0.0996910840  0.129396797            204
46:       0.113782586      5.694616e-05 0.0989921727  0.128572998            201
47:       0.112294395      5.602743e-05 0.0976237765  0.126965014            200
48:       0.110876335      5.519871e-05 0.0963146186  0.125438051            198
49:       0.106013940      5.240543e-05 0.0918254477  0.120202432            196
50:       0.103965080      5.124236e-05 0.0899349182  0.117995241            189
51:       0.101967974      5.013761e-05 0.0880898770  0.115846070            186
52:       0.099344067      4.870352e-05 0.0856658889  0.113022245            183
53:       0.096125139      4.697108e-05 0.0826924376  0.109557841            179
54:       0.091712919      4.463416e-05 0.0786186344  0.104807204            174
55:       0.085491775      4.134826e-05 0.0728886947  0.098094855            167
56:       0.082445445      3.976074e-05 0.0700866725  0.094804217            157
57:       0.075263022      3.605026e-05 0.0634950309  0.087031012            152
58:       0.071742449      3.425037e-05 0.0602719928  0.083212906            140
59:       0.065958913      3.131064e-05 0.0549917566  0.076926070            134
60:       0.063687689      3.016956e-05 0.0529222294  0.074453148            124
61:       0.060879313      2.876774e-05 0.0503669359  0.071391691            120
62:       0.055892832      2.629497e-05 0.0458424070  0.065943257            115
63:       0.049920906      2.336413e-05 0.0404471346  0.059394678            106
64:       0.046167772      2.152771e-05 0.0370739373  0.055261607             95
65:       0.042986564      1.997831e-05 0.0342260933  0.051747035             88
66:       0.036195530      1.668819e-05 0.0281888459  0.044202214             82
67:       0.032604986      1.496320e-05 0.0250233948  0.040186578             69
68:       0.027553315      1.255329e-05 0.0206090415  0.034497589             62
69:       0.024562705      1.113464e-05 0.0180225769  0.031102833             52
70:       0.021126338      9.519497e-06 0.0150791276  0.027173549             46
71:       0.018217353      8.160904e-06 0.0126182654  0.023816440             39
72:       0.016301679      7.273094e-06 0.0110159162  0.021587442             33
73:       0.012510934      5.525250e-06 0.0079038720  0.017117996             29
74:       0.012044036      5.312277e-06 0.0075266375  0.016561435             21
75:       0.010665493      4.692473e-06 0.0064197963  0.014911190             20
76:       0.007946296      3.482012e-06 0.0042889737  0.011603618             17
77:       0.004382565      1.913135e-06 0.0016716183  0.007093511             11
78:       0.003062117      1.335992e-06 0.0007966909  0.005327544              3
    re_d1_c3_estimate re_d1_c3_variance re_d1_c3_l95 re_d1_c3_u95 re_d1_c3_cases
    re_d2_c1_estimate re_d2_c1_variance re_d2_c1_l95 re_d2_c1_u95 re_d2_c1_cases
 1:       0.127244838      1.480532e-05  0.119703351  0.134786324            951
 2:       0.123854859      1.419678e-05  0.116469987  0.131239731            941
 3:       0.123270762      1.410189e-05  0.115910611  0.130630913            935
 4:       0.121942384      1.389213e-05  0.114637177  0.129247592            932
 5:       0.120295256      1.364219e-05  0.113056064  0.127534448            922
 6:       0.119411486      1.351321e-05  0.112206595  0.126616377            916
 7:       0.118376717      1.336629e-05  0.111211101  0.125542332            911
 8:       0.116858131      1.315565e-05  0.109749201  0.123967062            905
 9:       0.113433573      1.269706e-05  0.106449645  0.120417501            884
10:       0.111540212      1.245193e-05  0.104624030  0.118456393            875
11:       0.108599317      1.207771e-05  0.101787855  0.115410780            863
12:       0.104797711      1.160029e-05  0.098122230  0.111473192            844
13:       0.101656125      1.121015e-05  0.095093860  0.108218390            819
14:       0.098283303      1.079794e-05  0.091842818  0.104723787            798
15:       0.095554745      1.047029e-05  0.089212725  0.101896764            775
16:       0.090602369      9.880581e-06  0.084441538  0.096763201            756
17:       0.087543233      9.520294e-06  0.081495770  0.093590697            721
18:       0.082619167      8.946076e-06  0.076756917  0.088481418            699
19:       0.077919471      8.403585e-06  0.072237743  0.083601198            663
20:       0.071716839      7.692833e-06  0.066280692  0.077152987            628
21:       0.066776397      7.129112e-06  0.061543215  0.072009578            581
22:       0.062170412      6.607360e-06  0.057132367  0.067208458            543
23:       0.058386298      6.181481e-06  0.053513321  0.063259275            507
24:       0.053799712      5.670442e-06  0.049132511  0.058466914            477
25:       0.048677205      5.103778e-06  0.044249344  0.053105066            440
26:       0.043990294      4.588086e-06  0.039792087  0.048188501            398
27:       0.040914025      4.252467e-06  0.036872283  0.044955767            359
28:       0.036031405      3.725298e-06  0.032248473  0.039814338            333
29:       0.031905514      3.282315e-06  0.028354616  0.035456412            291
30:       0.028514245      2.920606e-06  0.025164709  0.031863780            255
31:       0.025954775      2.650412e-06  0.022763937  0.029145613            225
32:       0.021891219      2.224377e-06  0.018968062  0.024814377            202
33:       0.018427355      1.863841e-06  0.015751561  0.021103148            165
34:       0.015755682      1.587679e-06  0.013286065  0.018225298            133
35:       0.013116957      1.316913e-06  0.010867765  0.015366149            108
36:       0.010406026      1.040692e-06  0.008406583  0.012405470             83
37:       0.008242416      8.218221e-07  0.006465623  0.010019210             57
38:       0.006410916      6.381418e-07  0.004845222  0.007976609             36
39:       0.004600000      4.579298e-07  0.003273682  0.005926318             18
40:       0.127244838      1.480532e-05  0.119703351  0.134786324            951
41:       0.123854859      1.419678e-05  0.116469987  0.131239731            941
42:       0.123270762      1.410189e-05  0.115910611  0.130630913            935
43:       0.121942384      1.389213e-05  0.114637177  0.129247592            932
44:       0.120295256      1.364219e-05  0.113056064  0.127534448            922
45:       0.119411486      1.351321e-05  0.112206595  0.126616377            916
46:       0.118376717      1.336629e-05  0.111211101  0.125542332            911
47:       0.116858131      1.315565e-05  0.109749201  0.123967062            905
48:       0.113433573      1.269706e-05  0.106449645  0.120417501            884
49:       0.111540212      1.245193e-05  0.104624030  0.118456393            875
50:       0.108599317      1.207771e-05  0.101787855  0.115410780            863
51:       0.104797711      1.160029e-05  0.098122230  0.111473192            844
52:       0.101656125      1.121015e-05  0.095093860  0.108218390            819
53:       0.098283303      1.079794e-05  0.091842818  0.104723787            798
54:       0.095554745      1.047029e-05  0.089212725  0.101896764            775
55:       0.090602369      9.880581e-06  0.084441538  0.096763201            756
56:       0.087543233      9.520294e-06  0.081495770  0.093590697            721
57:       0.082619167      8.946076e-06  0.076756917  0.088481418            699
58:       0.077919471      8.403585e-06  0.072237743  0.083601198            663
59:       0.071716839      7.692833e-06  0.066280692  0.077152987            628
60:       0.066776397      7.129112e-06  0.061543215  0.072009578            581
61:       0.062170412      6.607360e-06  0.057132367  0.067208458            543
62:       0.058386298      6.181481e-06  0.053513321  0.063259275            507
63:       0.053799712      5.670442e-06  0.049132511  0.058466914            477
64:       0.048677205      5.103778e-06  0.044249344  0.053105066            440
65:       0.043990294      4.588086e-06  0.039792087  0.048188501            398
66:       0.040914025      4.252467e-06  0.036872283  0.044955767            359
67:       0.036031405      3.725298e-06  0.032248473  0.039814338            333
68:       0.031905514      3.282315e-06  0.028354616  0.035456412            291
69:       0.028514245      2.920606e-06  0.025164709  0.031863780            255
70:       0.025954775      2.650412e-06  0.022763937  0.029145613            225
71:       0.021891219      2.224377e-06  0.018968062  0.024814377            202
72:       0.018427355      1.863841e-06  0.015751561  0.021103148            165
73:       0.015755682      1.587679e-06  0.013286065  0.018225298            133
74:       0.013116957      1.316913e-06  0.010867765  0.015366149            108
75:       0.010406026      1.040692e-06  0.008406583  0.012405470             83
76:       0.008242416      8.218221e-07  0.006465623  0.010019210             57
77:       0.006410916      6.381418e-07  0.004845222  0.007976609             36
78:       0.004600000      4.579298e-07  0.003273682  0.005926318             18
    re_d2_c1_estimate re_d2_c1_variance re_d2_c1_l95 re_d2_c1_u95 re_d2_c1_cases
    h2_d1_estimate   h2_d1_se    h2_d1_l95 h2_d1_u95 h2_d2_estimate   h2_d2_se   h2_d2_l95
 1:      0.5404714 0.04486227  0.452541391 0.6284015     0.55594467 0.04377020  0.47015509
 2:      0.5343868 0.04460302  0.446964854 0.6218087     0.54341626 0.04330585  0.45853679
 3:      0.5278506 0.04439300  0.440840272 0.6148608     0.53932799 0.04337365  0.45431563
 4:      0.5225274 0.04426925  0.435759685 0.6092952     0.52894089 0.04316818  0.44433127
 5:      0.5157823 0.04424807  0.429056050 0.6025085     0.52419473 0.04310537  0.43970821
 6:      0.5121963 0.04410912  0.425742380 0.5986501     0.52232415 0.04313836  0.43777296
 7:      0.5034111 0.04384708  0.417470866 0.5893514     0.51815459 0.04303504  0.43380591
 8:      0.4985272 0.04386614  0.412549577 0.5845048     0.51367549 0.04289218  0.42960682
 9:      0.4888633 0.04367191  0.403266352 0.5744603     0.49834414 0.04280286  0.41445054
10:      0.4798317 0.04328536  0.394992409 0.5646710     0.49072019 0.04258129  0.40726086
11:      0.4676125 0.04306095  0.383213039 0.5520120     0.48324961 0.04231974  0.40030292
12:      0.4597418 0.04304482  0.375373949 0.5441097     0.46361746 0.04193594  0.38142302
13:      0.4618086 0.04278004  0.377959751 0.5456575     0.45233220 0.04204984  0.36991451
14:      0.4449031 0.04223320  0.362126028 0.5276802     0.43106163 0.04184622  0.34904304
15:      0.4313408 0.04204069  0.348941001 0.5137405     0.42701740 0.04211030  0.34448120
16:      0.4158257 0.04204873  0.333410200 0.4982412     0.41657078 0.04150311  0.33522468
17:      0.4141872 0.04204601  0.331777010 0.4965974     0.40969514 0.04176294  0.32783977
18:      0.3894662 0.04126652  0.308583868 0.4703486     0.39495769 0.04123861  0.31413002
19:      0.3725325 0.04158536  0.291025177 0.4540398     0.38835046 0.04129350  0.30741520
20:      0.3660495 0.04175861  0.284202622 0.4478964     0.36296923 0.04069612  0.28320485
21:      0.3775338 0.04186210  0.295484030 0.4595835     0.35016891 0.04120419  0.26940870
22:      0.3520209 0.04117933  0.271309432 0.4327324     0.34783897 0.04140864  0.26667803
23:      0.3277568 0.04142538  0.246563081 0.4089506     0.34626283 0.04156012  0.26480499
24:      0.3103832 0.04181136  0.228432986 0.3923335     0.33295769 0.04120847  0.25218909
25:      0.3102672 0.04228510  0.227388401 0.3931460     0.32487877 0.04128121  0.24396760
26:      0.2908569 0.04253391  0.207490466 0.3742234     0.31717268 0.04158178  0.23567240
27:      0.2940907 0.04272785  0.210344139 0.3778373     0.31595048 0.04244304  0.23276212
28:      0.2885550 0.04366449  0.202972609 0.3741374     0.30961315 0.04186914  0.22754964
29:      0.2735296 0.04347004  0.188328292 0.3587309     0.29204330 0.04250454  0.20873440
30:      0.2770284 0.04522585  0.188385731 0.3656711     0.28151846 0.04375217  0.19576420
31:      0.2619107 0.04579470  0.172153037 0.3516683     0.27329237 0.04500617  0.18508028
32:      0.2564969 0.04648013  0.165395825 0.3475979     0.26486115 0.04491500  0.17682775
33:      0.2692087 0.04848639  0.174175338 0.3642420     0.24732505 0.04656071  0.15606607
34:      0.2313256 0.04872870  0.135817334 0.3268339     0.24217721 0.04941241  0.14532890
35:      0.2328372 0.05516126  0.124721180 0.3409533     0.22506049 0.05121046  0.12468800
36:      0.1901538 0.05724968  0.077944438 0.3023632     0.19309647 0.05431844  0.08663232
37:      0.1735423 0.06156176  0.052881241 0.2942033     0.16261499 0.06177753  0.04153104
38:      0.1482191 0.07181572  0.007460276 0.2889779     0.10799779 0.07260989 -0.03431761
39:      0.1087617 0.11003160 -0.106900185 0.3244237     0.06922149 0.10079914 -0.12834483
40:      0.5404714 0.04486227  0.452541391 0.6284015     0.55594467 0.04377020  0.47015509
41:      0.5343868 0.04460302  0.446964854 0.6218087     0.54341626 0.04330585  0.45853679
42:      0.5278506 0.04439300  0.440840272 0.6148608     0.53932799 0.04337365  0.45431563
43:      0.5225274 0.04426925  0.435759685 0.6092952     0.52894089 0.04316818  0.44433127
44:      0.5157823 0.04424807  0.429056050 0.6025085     0.52419473 0.04310537  0.43970821
45:      0.5121963 0.04410912  0.425742380 0.5986501     0.52232415 0.04313836  0.43777296
46:      0.5034111 0.04384708  0.417470866 0.5893514     0.51815459 0.04303504  0.43380591
47:      0.4985272 0.04386614  0.412549577 0.5845048     0.51367549 0.04289218  0.42960682
48:      0.4888633 0.04367191  0.403266352 0.5744603     0.49834414 0.04280286  0.41445054
49:      0.4798317 0.04328536  0.394992409 0.5646710     0.49072019 0.04258129  0.40726086
50:      0.4676125 0.04306095  0.383213039 0.5520120     0.48324961 0.04231974  0.40030292
51:      0.4597418 0.04304482  0.375373949 0.5441097     0.46361746 0.04193594  0.38142302
52:      0.4618086 0.04278004  0.377959751 0.5456575     0.45233220 0.04204984  0.36991451
53:      0.4449031 0.04223320  0.362126028 0.5276802     0.43106163 0.04184622  0.34904304
54:      0.4313408 0.04204069  0.348941001 0.5137405     0.42701740 0.04211030  0.34448120
55:      0.4158257 0.04204873  0.333410200 0.4982412     0.41657078 0.04150311  0.33522468
56:      0.4141872 0.04204601  0.331777010 0.4965974     0.40969514 0.04176294  0.32783977
57:      0.3894662 0.04126652  0.308583868 0.4703486     0.39495769 0.04123861  0.31413002
58:      0.3725325 0.04158536  0.291025177 0.4540398     0.38835046 0.04129350  0.30741520
59:      0.3660495 0.04175861  0.284202622 0.4478964     0.36296923 0.04069612  0.28320485
60:      0.3775338 0.04186210  0.295484030 0.4595835     0.35016891 0.04120419  0.26940870
61:      0.3520209 0.04117933  0.271309432 0.4327324     0.34783897 0.04140864  0.26667803
62:      0.3277568 0.04142538  0.246563081 0.4089506     0.34626283 0.04156012  0.26480499
63:      0.3103832 0.04181136  0.228432986 0.3923335     0.33295769 0.04120847  0.25218909
64:      0.3102672 0.04228510  0.227388401 0.3931460     0.32487877 0.04128121  0.24396760
65:      0.2908569 0.04253391  0.207490466 0.3742234     0.31717268 0.04158178  0.23567240
66:      0.2940907 0.04272785  0.210344139 0.3778373     0.31595048 0.04244304  0.23276212
67:      0.2885550 0.04366449  0.202972609 0.3741374     0.30961315 0.04186914  0.22754964
68:      0.2735296 0.04347004  0.188328292 0.3587309     0.29204330 0.04250454  0.20873440
69:      0.2770284 0.04522585  0.188385731 0.3656711     0.28151846 0.04375217  0.19576420
70:      0.2619107 0.04579470  0.172153037 0.3516683     0.27329237 0.04500617  0.18508028
71:      0.2564969 0.04648013  0.165395825 0.3475979     0.26486115 0.04491500  0.17682775
72:      0.2692087 0.04848639  0.174175338 0.3642420     0.24732505 0.04656071  0.15606607
73:      0.2313256 0.04872870  0.135817334 0.3268339     0.24217721 0.04941241  0.14532890
74:      0.2328372 0.05516126  0.124721180 0.3409533     0.22506049 0.05121046  0.12468800
75:      0.1901538 0.05724968  0.077944438 0.3023632     0.19309647 0.05431844  0.08663232
76:      0.1735423 0.06156176  0.052881241 0.2942033     0.16261499 0.06177753  0.04153104
77:      0.1482191 0.07181572  0.007460276 0.2889779     0.10799779 0.07260989 -0.03431761
78:      0.1087617 0.11003160 -0.106900185 0.3244237     0.06922149 0.10079914 -0.12834483
    h2_d1_estimate   h2_d1_se    h2_d1_l95 h2_d1_u95 h2_d2_estimate   h2_d2_se   h2_d2_l95
    h2_d2_u95 gc_d1_d2_rhh gc_d1_d2_estimate gc_d1_d2_se gc_d1_d2_l95 gc_d1_d2_u95
 1: 0.6417343 -0.050615055       -0.09233738  0.05718490   -0.1626975   0.06146734
 2: 0.6282957 -0.056211494       -0.10431120  0.05670484   -0.1673530   0.05492999
 3: 0.6243403 -0.062419656       -0.11698748  0.05656828   -0.1732935   0.04845418
 4: 0.6135505 -0.062456295       -0.11880046  0.05654097   -0.1732766   0.04836400
 5: 0.6086812 -0.070011733       -0.13464533  0.05663439   -0.1810151   0.04099168
 6: 0.6068753 -0.076862576       -0.14860270  0.05646670   -0.1875373   0.03381216
 7: 0.6025033 -0.069631847       -0.13633797  0.05653070   -0.1804320   0.04116833
 8: 0.5977442 -0.069814604       -0.13796134  0.05633460   -0.1802304   0.04060122
 9: 0.5822377 -0.054570193       -0.11055976  0.05596226   -0.1642562   0.05511584
10: 0.5741795 -0.067945598       -0.14002316  0.05558271   -0.1768877   0.04099651
11: 0.5661963 -0.061243660       -0.12883454  0.05570947   -0.1704342   0.04794689
12: 0.5458119 -0.056139879       -0.12160028  0.05536694   -0.1646591   0.05237933
13: 0.5347499 -0.048082758       -0.10520336  0.05507224   -0.1560243   0.05985882
14: 0.5130802 -0.039525902       -0.09025669  0.05479645   -0.1469269   0.06787514
15: 0.5095536 -0.035597982       -0.08294541  0.05468023   -0.1427712   0.07157527
16: 0.4979169 -0.050025374       -0.12019607  0.05432475   -0.1565019   0.05645113
17: 0.4915505 -0.041394452       -0.10048782  0.05492245   -0.1490424   0.06625354
18: 0.4757854 -0.049769053       -0.12689636  0.05417741   -0.1559568   0.05641867
19: 0.4692857 -0.039265197       -0.10323187  0.05485321   -0.1467775   0.06824709
20: 0.4427336 -0.048741622       -0.13371963  0.05426705   -0.1551050   0.05762179
21: 0.4309291 -0.031690525       -0.08715910  0.05488440   -0.1392639   0.07588289
22: 0.4289999 -0.015734651       -0.04496595  0.05456866   -0.1226892   0.09121992
23: 0.4277207 -0.016084488       -0.04774506  0.05440111   -0.1227107   0.09054168
24: 0.4137263 -0.025459226       -0.07919569  0.05459948   -0.1324742   0.08155574
25: 0.4057899 -0.014661740       -0.04618032  0.05542507   -0.1232949   0.09397139
26: 0.3986730 -0.007320015       -0.02410041  0.05587095   -0.1168271   0.10218704
27: 0.3991388 -0.023607623       -0.07744655  0.05595973   -0.1332887   0.08607346
28: 0.3916767 -0.027673725       -0.09258564  0.05798204   -0.1413185   0.08597108
29: 0.3753522 -0.037053674       -0.13110085  0.05853324   -0.1517788   0.07767148
30: 0.3672727 -0.035885130       -0.12849876  0.06129489   -0.1560231   0.08425285
31: 0.3615045 -0.049651650       -0.18558520  0.06299093   -0.1731139   0.07381057
32: 0.3528946 -0.040765804       -0.15640328  0.06460788   -0.1673972   0.08586563
33: 0.3385840 -0.021137399       -0.08191680  0.06746703   -0.1533728   0.11109797
34: 0.3390255 -0.036389184       -0.15374246  0.06910335   -0.1718318   0.09905338
35: 0.3254330 -0.005909955       -0.02581715  0.07731209   -0.1574417   0.14562174
36: 0.2995606 -0.004291017       -0.02239343  0.07766796   -0.1565202   0.14793818
37: 0.2836989 -0.006773163       -0.04031889  0.08086093   -0.1652606   0.15171427
38: 0.2503132 -0.059790405       -0.47257637  0.09383113   -0.2436994   0.12411861
39: 0.2667878 -0.076525482       -0.88195723  0.15582821   -0.3819488   0.22889780
40: 0.6417343 -0.050615055       -0.09233738  0.05718490   -0.1626975   0.06146734
41: 0.6282957 -0.056211494       -0.10431120  0.05670484   -0.1673530   0.05492999
42: 0.6243403 -0.062419656       -0.11698748  0.05656828   -0.1732935   0.04845418
43: 0.6135505 -0.062456295       -0.11880046  0.05654097   -0.1732766   0.04836400
44: 0.6086812 -0.070011733       -0.13464533  0.05663439   -0.1810151   0.04099168
45: 0.6068753 -0.076862576       -0.14860270  0.05646670   -0.1875373   0.03381216
46: 0.6025033 -0.069631847       -0.13633797  0.05653070   -0.1804320   0.04116833
47: 0.5977442 -0.069814604       -0.13796134  0.05633460   -0.1802304   0.04060122
48: 0.5822377 -0.054570193       -0.11055976  0.05596226   -0.1642562   0.05511584
49: 0.5741795 -0.067945598       -0.14002316  0.05558271   -0.1768877   0.04099651
50: 0.5661963 -0.061243660       -0.12883454  0.05570947   -0.1704342   0.04794689
51: 0.5458119 -0.056139879       -0.12160028  0.05536694   -0.1646591   0.05237933
52: 0.5347499 -0.048082758       -0.10520336  0.05507224   -0.1560243   0.05985882
53: 0.5130802 -0.039525902       -0.09025669  0.05479645   -0.1469269   0.06787514
54: 0.5095536 -0.035597982       -0.08294541  0.05468023   -0.1427712   0.07157527
55: 0.4979169 -0.050025374       -0.12019607  0.05432475   -0.1565019   0.05645113
56: 0.4915505 -0.041394452       -0.10048782  0.05492245   -0.1490424   0.06625354
57: 0.4757854 -0.049769053       -0.12689636  0.05417741   -0.1559568   0.05641867
58: 0.4692857 -0.039265197       -0.10323187  0.05485321   -0.1467775   0.06824709
59: 0.4427336 -0.048741622       -0.13371963  0.05426705   -0.1551050   0.05762179
60: 0.4309291 -0.031690525       -0.08715910  0.05488440   -0.1392639   0.07588289
61: 0.4289999 -0.015734651       -0.04496595  0.05456866   -0.1226892   0.09121992
62: 0.4277207 -0.016084488       -0.04774506  0.05440111   -0.1227107   0.09054168
63: 0.4137263 -0.025459226       -0.07919569  0.05459948   -0.1324742   0.08155574
64: 0.4057899 -0.014661740       -0.04618032  0.05542507   -0.1232949   0.09397139
65: 0.3986730 -0.007320015       -0.02410041  0.05587095   -0.1168271   0.10218704
66: 0.3991388 -0.023607623       -0.07744655  0.05595973   -0.1332887   0.08607346
67: 0.3916767 -0.027673725       -0.09258564  0.05798204   -0.1413185   0.08597108
68: 0.3753522 -0.037053674       -0.13110085  0.05853324   -0.1517788   0.07767148
69: 0.3672727 -0.035885130       -0.12849876  0.06129489   -0.1560231   0.08425285
70: 0.3615045 -0.049651650       -0.18558520  0.06299093   -0.1731139   0.07381057
71: 0.3528946 -0.040765804       -0.15640328  0.06460788   -0.1673972   0.08586563
72: 0.3385840 -0.021137399       -0.08191680  0.06746703   -0.1533728   0.11109797
73: 0.3390255 -0.036389184       -0.15374246  0.06910335   -0.1718318   0.09905338
74: 0.3254330 -0.005909955       -0.02581715  0.07731209   -0.1574417   0.14562174
75: 0.2995606 -0.004291017       -0.02239343  0.07766796   -0.1565202   0.14793818
76: 0.2836989 -0.006773163       -0.04031889  0.08086093   -0.1652606   0.15171427
77: 0.2503132 -0.059790405       -0.47257637  0.09383113   -0.2436994   0.12411861
78: 0.2667878 -0.076525482       -0.88195723  0.15582821   -0.3819488   0.22889780
    h2_d2_u95 gc_d1_d2_rhh gc_d1_d2_estimate gc_d1_d2_se gc_d1_d2_l95 gc_d1_d2_u95
    gc_d1_d2_gm_h2 gc_d1_d2_gm_h2_l95 gc_d1_d2_gm_h2_u95
 1:     0.54815346         -0.2968100         0.11213528
 2:     0.53888261         -0.3105555         0.10193313
 3:     0.53355841         -0.3247882         0.09081326
 4:     0.52572438         -0.3295959         0.09199498
 5:     0.51997148         -0.3481251         0.07883448
 6:     0.51723541         -0.3625763         0.06537092
 7:     0.51072967         -0.3532828         0.08060689
 8:     0.50604467         -0.3561552         0.08023247
 9:     0.49358096         -0.3327848         0.11166526
10:     0.48524541         -0.3645325         0.08448614
11:     0.47536676         -0.3585320         0.10086295
12:     0.46167556         -0.3566554         0.11345484
13:     0.45704586         -0.3413757         0.13096897
14:     0.43792768         -0.3355050         0.15499167
15:     0.42917363         -0.3326654         0.16677463
16:     0.41619808         -0.3760274         0.13563524
17:     0.41193504         -0.3618106         0.16083493
18:     0.39220236         -0.3976436         0.14385092
19:     0.38035925         -0.3858917         0.17942798
20:     0.36450611         -0.4255211         0.15808183
21:     0.36359398         -0.3830205         0.20870228
22:     0.34992370         -0.3506171         0.26068519
23:     0.33688278         -0.3642533         0.26876316
24:     0.32147238         -0.4120858         0.25369441
25:     0.31748893         -0.3883438         0.29598320
26:     0.30372993         -0.3846413         0.33644048
27:     0.30482472         -0.4372634         0.28237033
28:     0.29889868         -0.4727974         0.28762616
29:     0.28263489         -0.5370138         0.27481209
30:     0.27926441         -0.5586932         0.30169563
31:     0.26754100         -0.6470555         0.27588507
32:     0.26064547         -0.6422411         0.32943459
33:     0.25803497         -0.5943876         0.43055395
34:     0.23668922         -0.7259805         0.41849554
35:     0.22891585         -0.6877709         0.63613657
36:     0.19161950         -0.8168282         0.77204139
37:     0.16798981         -0.9837537         0.90311589
38:     0.12652009         -1.9261717         0.98101898
39:     0.08676779         -4.4019647         2.63805029
40:     0.54815346         -0.2968100         0.11213528
41:     0.53888261         -0.3105555         0.10193313
42:     0.53355841         -0.3247882         0.09081326
43:     0.52572438         -0.3295959         0.09199498
44:     0.51997148         -0.3481251         0.07883448
45:     0.51723541         -0.3625763         0.06537092
46:     0.51072967         -0.3532828         0.08060689
47:     0.50604467         -0.3561552         0.08023247
48:     0.49358096         -0.3327848         0.11166526
49:     0.48524541         -0.3645325         0.08448614
50:     0.47536676         -0.3585320         0.10086295
51:     0.46167556         -0.3566554         0.11345484
52:     0.45704586         -0.3413757         0.13096897
53:     0.43792768         -0.3355050         0.15499167
54:     0.42917363         -0.3326654         0.16677463
55:     0.41619808         -0.3760274         0.13563524
56:     0.41193504         -0.3618106         0.16083493
57:     0.39220236         -0.3976436         0.14385092
58:     0.38035925         -0.3858917         0.17942798
59:     0.36450611         -0.4255211         0.15808183
60:     0.36359398         -0.3830205         0.20870228
61:     0.34992370         -0.3506171         0.26068519
62:     0.33688278         -0.3642533         0.26876316
63:     0.32147238         -0.4120858         0.25369441
64:     0.31748893         -0.3883438         0.29598320
65:     0.30372993         -0.3846413         0.33644048
66:     0.30482472         -0.4372634         0.28237033
67:     0.29889868         -0.4727974         0.28762616
68:     0.28263489         -0.5370138         0.27481209
69:     0.27926441         -0.5586932         0.30169563
70:     0.26754100         -0.6470555         0.27588507
71:     0.26064547         -0.6422411         0.32943459
72:     0.25803497         -0.5943876         0.43055395
73:     0.23668922         -0.7259805         0.41849554
74:     0.22891585         -0.6877709         0.63613657
75:     0.19161950         -0.8168282         0.77204139
76:     0.16798981         -0.9837537         0.90311589
77:     0.12652009         -1.9261717         0.98101898
78:     0.08676779         -4.4019647         2.63805029
    gc_d1_d2_gm_h2 gc_d1_d2_gm_h2_l95 gc_d1_d2_gm_h2_u95

$draw_meta
   draw   source fixed_meta    fixed_se  fixed_l95  fixed_u95  rand_meta    rand_se
1:    1    h2_d1  0.3842786 0.007209437  0.3701481  0.3984091  0.3720844 0.02062705
2:    2    h2_d1  0.3842786 0.007209437  0.3701481  0.3984091  0.3720844 0.02062705
3:    1    h2_d2  0.3898609 0.007075179  0.3759935  0.4037282  0.3757828 0.02153245
4:    2    h2_d2  0.3898609 0.007075179  0.3759935  0.4037282  0.3757828 0.02153245
5:    1 gc_d1_d2 -0.1102059 0.009453143 -0.1287340 -0.0916777 -0.1212077 0.02474457
6:    2 gc_d1_d2 -0.1102059 0.009453143 -0.1287340 -0.0916777 -0.1212077 0.02474457
     rand_l95    rand_u95
1:  0.3316554  0.41251345
2:  0.3316554  0.41251345
3:  0.3335792  0.41798637
4:  0.3335792  0.41798637
5: -0.1697070 -0.07270831
6: -0.1697070 -0.07270831

$draw_rubin
   fixed_meta  within_var between_var k_resamples  total_var  b_over_t  fixed_se  fixed_l95
1:  0.3672255 0.002353807  0.01435900          78 0.01689689 0.8498010 0.1299880  0.1124489
2:  0.3709979 0.002230349  0.01593769          78 0.01837236 0.8674815 0.1355447  0.1053303
3: -0.1316315 0.004174989  0.02000421          78 0.02443566 0.8186481 0.1563191 -0.4380169
   fixed_u95   source
1: 0.6220021    h2_d1
2: 0.6366655    h2_d2
3: 0.1747539 gc_d1_d2

$rubin_meta
   fixed_meta   fixed_se  fixed_l95 fixed_u95 rand_meta  rand_se   rand_l95  rand_u95
1:  0.2364481 0.08044247 0.07878088 0.3941153 0.2093499 0.185639 -0.1545025 0.5732023
#+end_example
